## (A) Привет, Яндекс!
Когда мы приходим на встречу, то первым делом здороваемся. Давайте тоже поприветствуем Яндекс.  
```
print('Привет, Яндекс!')
-

Привет, Яндекс!
```

## (B) Привет, всем!  
Но вообще, хорошо бы узнать имя собеседника, а уже потом его приветствовать.  
Напишите диалоговую программу, которая сначала познакомится со своим пользователем, а затем поздоровается с ним.
```
name = input('Как Вас зовут?')
print('Привет,', name)
-

Как Вас зовут?
Привет, Bob
```

## (C) Излишняя автоматизация
«Повторение — мать учения!» и «Если это можно автоматизировать — автоматизируй!»  
Этим принципам следуют многие программисты. Но что будет, если их объединить?  

**Формат ввода**
Одна строка — весьма полезная информация.

**Формат вывода**
Трижды повторённая весьма полезная информация.
```
t_1 = input()
t_1 = t_1 + '\n'
print(t_1 * 3)
-

2 + 2 = 4
2 + 2 = 4
2 + 2 = 4
```

## (D) Сдача
Чаще всего автоматизация идёт на пользу.  
Одна из задач, в которой лучше исключить человеческий фактор, — подсчёт сдачи.  
Определите, какую сдачу нужно выдать тому, кто купил 2,5кг черешни по цене 38 руб/кг.  

**Формат ввода**  
Одно натуральное число - номинал купюры пользователя (≥100).

**Формат вывода**  
Одно натуральное число — размер сдачи.
```
cash = int(input())
price = int(38)
weight = float(2.5)
change = cash - (price * weight)
print(int(change))
-

5
```

## (E) Магазин  
Кроме черешни в магазине продаётся множество других товаров, которые продаются на развес.  
Давайте автоматизируем расчёт сдачи и для них!  

**Формат ввода**
Три натуральных числа:  
* цена товара;  
* вес товара;  
* количество денег у пользователя.

**Формат вывода**
* Одно целое число — сдача, которую требуется отдать пользователю
```
price = int(input())
weight = int(input())
cash = int(input())
change = cash - (price * weight)
print(change)
-

4
```

## (F) Чек
Сдачу посчитать, конечно, все могут, но красивый чек напечатать — не так просто.  

Формат ввода:  
* название товара;  
* цена товара;  
* вес товара;  
* количество денег у пользователя.  

Формат вывода:  
* Чек  
* <название товара> - <вес>кг - <цена>руб/кг  
* Итого: <итоговая стоимость>руб  
* Внесено: <количество денег от пользователя>руб  
* Сдача: <сдача>руб
```
goods = input()
price = int(input())
weight = int(input())
cash = int(input())

total = price * weight
change = cash - total

print(f'Чек \n{goods} - {weight}кг - {price}руб/кг \nИтого: {total}руб \nВнесено: {cash}руб \nСдача: {change}руб')
-

Чек 
черешня - 3кг - 2руб/кг 
Итого: 6руб 
Внесено: 10руб 
Сдача: 4руб
```

## (G) Делу — время, потехе — час
Давайте передохнём от автоматизации и сделаем что-то действительно интересное.

Формат ввода:
* Одно натуральное число N

Формат вывода:
* N строк с фразой: "Купи слона!"
```
x = int(input())
for ph in range(x):
    print('Купи слона!')
```

## (H) Наказание  
Наше развлечение не осталось незамеченным...  
И наказание нам выбрали соответствующее.  

Формат ввода:  
* В первой строке записано одно натуральное число 𝑁  
* Во второй строке записана часть наказания.  

Формат вывода:  
* N строк вида: Я больше никогда не буду писать "<часть наказания>"!  
```
cnt = int(input())
ph = input('')
for c in range(cnt):
    print(f'Я больше никогда не буду писать "{ph}"!')
```

## (I) Деловая колбаса  
Настало время для действительно серьёзных задач...  
В детском саду 2 ребенка съедают 2 куска колбасы за 2 минуты. Сколько кусков колбасы за N минут съедят M детей?   

Формат ввода:  
* В первой строке записано натуральное число 𝑁 ≥ 1  
* Во второй строке записано натуральное число 𝑀 ≥ 1  

Формат вывода:  
* Одно натуральное число — количество кусков колбасы, съеденных детьми  

Примечание  
Гарантируется, что в результате вычислений будет получено натуральное число.  
```
N = int(input()) # время
M = int(input()) № дети
pieces = (M * N) // 2
print(int(pieces))
```

## (J) Детский сад — штаны на лямках 
В продолжение темы детского сада давайте и там что-нибудь автоматизируем.  
За каждым ребёнком закреплён шкафчик и кровать. Номер шкафчика состоит из трёх цифр:  
* номер группы в саду;  
* номер кроватки, закреплённой за ребёнком;  
* порядковый номер ребёнка в списке группы.  

Воспитатель просит сделать программу, которая по имени ребенка и номеру его шкафчика формирует «красивую» карточку для личного дела.  

Формат ввода:  
* В первой строке записано имя ребенка.  
* Во второй строке записан номер шкафчика.  

Формат вывода:  
* Карточка в виде:  

Группа №<номер группы>.   
<номер ребёнка в списке>. <имя ребенка>.   
Шкафчик: <номер шкафчика>.   
Кроватка: <номер кроватки>.   
```
child_name = input()  # Имя ребенка
locker_number = input()  # Номер шкафчика

# Вывод информации о группе, кроватке и шкафчике
print(f'Группа №{locker_number[0]}.')  # Первая цифра - группа
print(f'{locker_number[2]}. {child_name}.')  # Третья цифра - номер ребенка
print(f'Шкафчик: {locker_number}.')  # Номер шкафчика
print(f'Кроватка: {locker_number[1]}.')  # Вторая цифра - номер кроватки
```

## (K) Автоматизация игры
Всё в том же детском саду ребята очень любят играть с цифрами.  
Одна из таких игр — перестановка цифр четырёхзначного числа.  
Напишите программу для робота-няни, которая из числа вида abcd составляет число badc.  

Формат ввода:
* Одно четырёхзначное число.

Формат вывода:
* Одно четырёхзначное число — результат перестановки.
```
t = input() 
result = t[1] + t[0] + t[3] + t[2] 
print(result)
```

## (L) АИнтересное сложение
Всё 
